In [8]:
import numpy as np
import pandas as pd
import seaborn as sns

In [9]:
df = sns.load_dataset('titanic')

In [10]:
df.isna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [11]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [12]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [13]:
df.loc[df.embark_town.isna(),:]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [14]:
df.deck.value_counts()

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

In [15]:
df.deck.value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [16]:
df.deck.isna()
# 누락 데이터

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: deck, Length: 891, dtype: bool

In [17]:
~df.deck.isna()
# 누락 안된 데이터

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: deck, Length: 891, dtype: bool

In [18]:
df.isna().sum().sort_values()[::-1]

deck           688
age            177
embark_town      2
embarked         2
alone            0
alive            0
adult_male       0
who              0
class            0
fare             0
parch            0
sibsp            0
sex              0
pclass           0
survived         0
dtype: int64

In [19]:
np.around(df.isna().sum().sort_values()[::-1]/df.shape[0],2)

deck           0.77
age            0.20
embark_town    0.00
embarked       0.00
alone          0.00
alive          0.00
adult_male     0.00
who            0.00
class          0.00
fare           0.00
parch          0.00
sibsp          0.00
sex            0.00
pclass         0.00
survived       0.00
dtype: float64

In [20]:
raw_df = df.copy()
# 원본 다날리는거 방지용

In [21]:
raw_df.shape

(891, 15)

In [22]:
# row 지운다
df = df.loc[~df.deck.isna(),:]

In [23]:
df.shape

(203, 15)

In [24]:
df.isna().sum().sort_values()[::-1]

age            19
embark_town     2
embarked        2
alone           0
alive           0
deck            0
adult_male      0
who             0
class           0
fare            0
parch           0
sibsp           0
sex             0
pclass          0
survived        0
dtype: int64

In [25]:
df.shape[0]/raw_df.shape[0]

0.22783389450056116

In [26]:
# 72퍼였는데 지우고나니까 22퍼

In [27]:
df = raw_df

In [28]:
df.shape

(891, 15)

In [29]:
df.drop(columns=['deck']).isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
embark_town      2
alive            0
alone            0
dtype: int64

In [30]:
df.drop(columns=['deck'],inplace=True)

In [31]:
df.shape
# 열이 하나 사라진 모습

(891, 14)

In [32]:
# 891과 714는 안맞다

In [33]:
df.age.size

891

In [34]:
df.age.dropna().size

714

In [35]:
df.loc[df.embarked.isna()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,NaN,yes,True

In [36]:
df = df.loc[~df.embarked.isna()]

In [37]:
# index를 찾아서 drop으로 지우든가 loc 저렇게 지워도되고

In [38]:
df.shape

(889, 14)

In [39]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
embark_town      0
alive            0
alone            0
dtype: int64

In [40]:
# age만 남았다 => 지우기 불가능?

In [41]:
df = pd.DataFrame()

In [42]:
df['c1'] = ['a','a','b','a','b']
df['c2'] = [1,1,1,2,2]
df['c3'] = [1,1,2,2,2]

In [43]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [44]:
# duplicated

In [45]:
df[df.duplicated()]

  c1  c2  c3
1  a   1   1

In [46]:
df[~df.duplicated()]

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [47]:
df.loc[5] = ['a',1,1]

In [48]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
5  a   1   1

In [49]:
df.duplicated(keep='last')

0     True
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [50]:
~df.duplicated(keep='last')

0    False
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [51]:
df.iloc[0,:]

c1    a
c2    1
c3    1
Name: 0, dtype: object

In [52]:
df.shape[1]

3

In [53]:
sum(df.iloc[0,:] == df.iloc[1,:]) == df.shape[1]
sum(df.iloc[0,:] == df.iloc[2,:]) == df.shape[1]
sum(df.iloc[0,:] == df.iloc[3,:]) == df.shape[1]
sum(df.iloc[0,:] == df.iloc[4,:]) == df.shape[1]
sum(df.iloc[0,:] == df.iloc[5,:]) == df.shape[1]
sum(df.iloc[1,:] == df.iloc[2,:]) == df.shape[1]
sum(df.iloc[1,:] == df.iloc[3,:]) == df.shape[1]
sum(df.iloc[1,:] == df.iloc[4,:]) == df.shape[1]
sum(df.iloc[1,:] == df.iloc[5,:]) == df.shape[1]
sum(df.iloc[2,:] == df.iloc[3,:]) == df.shape[1]
sum(df.iloc[2,:] == df.iloc[4,:]) == df.shape[1]
sum(df.iloc[2,:] == df.iloc[5,:]) == df.shape[1]
sum(df.iloc[3,:] == df.iloc[4,:]) == df.shape[1]
sum(df.iloc[3,:] == df.iloc[5,:]) == df.shape[1]
sum(df.iloc[4,:] == df.iloc[5,:]) == df.shape[1]

# 이런 논리로 돌아간다

False

In [54]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
5  a   1   1

In [55]:
keep = 'first'
dup = []
for i in range(df.shape[0]-1):
    for j in range(df.shape[0]-i-1):
        if sum(df.iloc[i,:] == df.iloc[j+i+1,:]) == df.shape[1]:
            first = i
            last = j+i+1
            if keep == 'first':
                dup.append(last)
            else:
                dup.append(first)

dup = np.unique(dup)
result = np.full(df.shape[0],False)
result[dup] = True
df.loc[~result,:]

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [56]:
# 중복된 항목 지우기 완료

In [57]:
def my_duplicate(df,keep='first'):
    keep = 'first'
    dup = []
    for i in range(df.shape[0]-1):
        for j in range(df.shape[0]-i-1):
            if sum(df.iloc[i,:] == df.iloc[j+i+1,:]) == df.shape[1]:
                first = i
                last = j+i+1
                if keep == 'first':
                    dup.append(last)
                else:
                    dup.append(first)

    dup = np.unique(dup)
    result = np.full(df.shape[0],False)
    result[dup] = True
    return result

In [58]:
# 함수로 만들어 봤어요

In [59]:
my_duplicate(df)

array([False,  True, False, False, False,  True])

In [60]:
df.loc[~my_duplicate(df),:]

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [61]:
df.loc[~my_duplicate(df,keep='last'),:]

# 왜 마지막행만 남기지않는가

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [62]:
import sklearn

In [63]:
from sklearn.preprocessing import StandardScaler
from sklearn import datasets

In [64]:
data = datasets.load_iris()

In [65]:
data.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [66]:
df = pd.DataFrame(data['data'],columns=data['feature_names'])

In [67]:
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [68]:
sc = StandardScaler()
sc.fit(df)

StandardScaler()

In [69]:
sc.transform(df).shape

(150, 4)

In [70]:
df.shape

(150, 4)

In [71]:
np.max(df.values) - np.min(df.values)

7.800000000000001

In [72]:
np.max(sc.transform(df)) - np.min(sc.transform(df))

5.524722390207515

In [73]:
# 이렇게는 안하는게 좋다
# sc.fit_trasform(df)
# fit, transform은 따로 쓰자!

In [74]:
def standard_scaler(df):
    result = np.zeros_like(df)
    for i in range(df.columns.size):
        result[:,i] = (df.iloc[:,1]-df.iloc[:,i].mean()/df.iloc[:,i].std)
        return result

In [156]:
sc = Standard_scaler(df)

NameError: name 'Standard_scaler' is not defined

In [157]:
from sklearn.pro

SyntaxError: invalid syntax (1383279268.py, line 1)

In [158]:
from sklearn.preprocessing import minmaxscaler
mms = minmaxscaler()
mms.fit(df)
mms.transform(df)

ImportError: cannot import name 'minmaxscaler' from 'sklearn.preprocessing' (C:\Users\bjlov\anaconda3\lib\site-packages\sklearn\preprocessing\__init__.py)

In [159]:
def minmax_scaler(df):
    result = np.zeros_like(df)
    for i in range(df.columns_size):
        result[:,i] = (df,iloc[:,i] - df.iloc[:i].min())/(df.iloc[:,].max() - df.iloc[:,i].min())
    return result 

def minmax_scaler(df):
    result = np.zeros_like(df)
    for i in range(df.columns.size):
        result[:,i] = ( df.iloc[:,i] - df.iloc[:,i].min() ) / (df.iloc[:,i].max() - df.iloc[:,i].min())
    return result

In [160]:
mms.transform(df)[:3]

NameError: name 'mms' is not defined

In [161]:
titanic = sns.load_dataset('titanic')

In [162]:
titanic.age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [163]:
age = titanic.age.fillna(titanic.age.mean())

In [164]:
age

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [165]:
pd.cut(age,5).dtype

CategoricalDtype(categories=[(0.34, 16.336], (16.336, 32.252], (32.252, 48.168], (48.168, 64.084], (64.084, 80.0]], ordered=True)

In [166]:
np.linspace(age.min(),age.max(),5)

array([ 0.42 , 20.315, 40.21 , 60.105, 80.   ])

In [167]:
day = pd.to_datetime(['2022-01-01'])

In [168]:
day = np.datetime64('2022-01-01') + np.arange(365)

In [169]:
sales = np.random.randint(60,100,day.size)

In [170]:
location = np.random.choice(['서울','부산','세종'],day.size)

In [171]:
sales_report = pd.DataFrame()
sales_report['day'] = day
sales_report['location'] = location
sales_report['sales'] = sales

In [172]:
sales_report.head

<bound method NDFrame.head of            day location  sales
0   2022-01-01       세종     98
1   2022-01-02       서울     78
2   2022-01-03       세종     70
3   2022-01-04       서울     67
4   2022-01-05       세종     77
..         ...      ...    ...
360 2022-12-27       부산     68
361 2022-12-28       세종     64
362 2022-12-29       세종     71
363 2022-12-30       세종     62
364 2022-12-31       서울     90

[365 rows x 3 columns]>

In [173]:
day_str = sales_report.day.astype('str')

In [174]:
sales_report['day_str'] = day_str

In [175]:
sales_report.loc[sales_report.day_str.str.slice(5,7) == '01']

          day location  sales     day_str
0  2022-01-01       세종     98  2022-01-01
1  2022-01-02       서울     78  2022-01-02
2  2022-01-03       세종     70  2022-01-03
3  2022-01-04       서울     67  2022-01-04
4  2022-01-05       세종     77  2022-01-05
5  2022-01-06       세종     67  2022-01-06
6  2022-01-07       부산     87  2022-01-07
7  2022-01-08       서울     77  2022-01-08
8  2022-01-09       부산     81  2022-01-09
9  2022-01-10       세종     93  2022-01-10
10 2022-01-11       세종     80  2022-01-11
11 2022-01-12       서울     79  2022-01-12
12 2022-01-13       부산     84  2022-01-13
13 2022-01-14       세종     72  2022-01-14
14 2022-01-15       세종     78  2022-01-15
15 2022-01-16       부산     60  2022-01-16
16 2022-01-17       세종     94  2022-01-17
17 2022-01-18       서울     71  2022-01-18
18 2022-01-19       부산     94  2022-01-19
19 2022-01-20       세종     79  2022-01-20
20 2022-01-21       부산     87  2022-01-21
21 2022-01-22       서울     91  2022-01-22
22 2022-01-23       세종     61  2022-01-23
23 2022-01-24       부산     60  2022-01-24
24 2022-01-25       부산     80  2022-01-25
25 2022-01-26       세종     98  2022-01-26
26 2022-01-27       서울     81  2022-01-27
27 2022-01-28       서울     74  2022-01-28
28 2022-01-29       세종     99  2022-01-29
29 2022-01-30       부산     88  2022-01-30
30 2022-01-31       세종     66  2022-01-31

In [176]:
sales_report.value_counts(['day_str','location'])

day_str     location
2022-01-01  세종          1
2022-09-09  서울          1
2022-09-07  부산          1
2022-09-06  세종          1
2022-09-05  서울          1
                       ..
2022-05-01  서울          1
2022-04-30  세종          1
2022-04-29  서울          1
2022-04-28  세종          1
2022-12-31  서울          1
Length: 365, dtype: int64

In [177]:
sales_report.day_str.str.slice(5,7)

0      01
1      01
2      01
3      01
4      01
       ..
360    12
361    12
362    12
363    12
364    12
Name: day_str, Length: 365, dtype: object

In [178]:
sales_report.groupby(['day_str','location']).sum()

                     sales
day_str    location
2022-01-01 세종           98
2022-01-02 서울           78
2022-01-03 세종           70
2022-01-04 서울           67
2022-01-05 세종           77
...                    ...
2022-12-27 부산           68
2022-12-28 세종           64
2022-12-29 세종           71
2022-12-30 세종           62
2022-12-31 서울           90

[365 rows x 1 columns]

In [179]:
sales_report.groupby(['day_str','location']).sum().reset_index()

        day_str location  sales
0    2022-01-01       세종     98
1    2022-01-02       서울     78
2    2022-01-03       세종     70
3    2022-01-04       서울     67
4    2022-01-05       세종     77
..          ...      ...    ...
360  2022-12-27       부산     68
361  2022-12-28       세종     64
362  2022-12-29       세종     71
363  2022-12-30       세종     62
364  2022-12-31       서울     90

[365 rows x 3 columns]

In [180]:
month = sales_report.day_str.str.slice(5,7)

In [181]:
sales_report['month'] = month

In [182]:
sales_report.groupby(['month','location']).sum().reset_index()

   month location  sales
0     01       부산    721
1     01       서울    618
2     01       세종   1132
3     02       부산    607
4     02       서울    744
5     02       세종    761
6     03       부산   1079
7     03       서울    801
8     03       세종    632
9     04       부산    746
10    04       서울    979
11    04       세종    680
12    05       부산    803
13    05       서울   1098
14    05       세종    532
15    06       부산    723
16    06       서울    947
17    06       세종    753
18    07       부산    762
19    07       서울   1007
20    07       세종    708
21    08       부산    854
22    08       서울    941
23    08       세종    665
24    09       부산    940
25    09       서울    922
26    09       세종    575
27    10       부산    583
28    10       서울    630
29    10       세종   1259
30    11       부산    562
31    11       서울    936
32    11       세종    949
33    12       부산    666
34    12       서울    806
35    12       세종    855

In [183]:
sales_total = sales_report.groupby(['month','location']).sum().reset_index()

In [184]:
sales_total.head()

  month location  sales
0    01       부산    721
1    01       서울    618
2    01       세종   1132
3    02       부산    607
4    02       서울    744

In [185]:
sales_pivot = sales_total.pivot(index=['location'],columns=['month'],values=['sales'])

In [186]:
sales_pivot

         sales
month       01   02    03   04    05   06    07   08   09    10   11   12
location
부산         721  607  1079  746   803  723   762  854  940   583  562  666
서울         618  744   801  979  1098  947  1007  941  922   630  936  806
세종        1132  761   632  680   532  753   708  665  575  1259  949  855

In [187]:
sales_pivot.columns = ['month_' + j for _,j in sales_pivot.columns]

In [188]:
sales_pivot.iloc[1,1] = np.nan
sales_pivot.iloc[2,3] = np.nan

In [189]:
day = np.datetime64('2023-01-01')

In [190]:
day = day + np.arange(365)

In [191]:
day_str = day.astype('str')

In [192]:
pd.Series(day_str).str.slice(5,7)
month = pd.Series(day_str).str[5:7]

In [193]:
sales_report = pd.DataFrame()
sales_report['day'] = day
sales_report['month'] = month
sales_report['location'] = np.random.choice(['서울','부산','세종'],month.size)
sales_report['sales'] = np.random.randint(60,100,month.size)

In [194]:
sales_report

           day month location  sales
0   2023-01-01    01       세종     81
1   2023-01-02    01       세종     78
2   2023-01-03    01       서울     76
3   2023-01-04    01       세종     81
4   2023-01-05    01       부산     97
..         ...   ...      ...    ...
360 2023-12-27    12       부산     77
361 2023-12-28    12       부산     97
362 2023-12-29    12       서울     62
363 2023-12-30    12       부산     66
364 2023-12-31    12       서울     62

[365 rows x 4 columns]

In [200]:
sales_df = sales_report.groupby(['month,'location]).sum().reset_index()
# 놓쳐버림

SyntaxError: invalid syntax (1360400292.py, line 1)

In [201]:
sales_pivot = sales_df.pivot(index=['location'],columns=['month'],values=['sales'])

NameError: name 'sales_df' is not defined

In [214]:
x = pd.date_range('2023-01-01',
            periods=365,
            freq='B')
sales_total = pd.DataFrame()
sales_total['day'] = day
sales_total['location'] = np.random.choice(['서울','부산','세종'])
sales_total['sales'] = np.random.randint(60,100,day.size)

In [215]:
sales_total.day.dt.month

0       1
1       1
2       1
3       1
4       1
       ..
360    12
361    12
362    12
363    12
364    12
Name: day, Length: 365, dtype: int64

In [217]:
sales_total.groupby([sales_total.day.dt.month,'location']).sum()

              sales
day location
1   세종         2534
2   세종         2240
3   세종         2458
4   세종         2351
5   세종         2484
6   세종         2372
7   세종         2483
8   세종         2443
9   세종         2315
10  세종         2489
11  세종         2436
12  세종         2592